In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(np.random.randn(8, 3),
                      columns=['A', 'B', 'C'])

In [4]:
df.columns = [x.lower() for x in df.columns]

In [5]:
df

          a         b         c
0  1.017720 -0.938917 -0.356571
1  0.525362  1.077024  0.362364
2  1.955011 -0.425092 -1.042216
3  0.299591 -1.988031 -0.921123
4 -1.182346 -0.296538  0.657919
5  0.172286 -0.683108 -0.022970
6  0.756194  2.058182  0.422938
7 -0.468912 -2.448525  0.812787

In [6]:
df.a.array

<PandasArray>
[ 1.0177199604601035,  0.5253616630209202,  1.9550111670131392,
  0.2995906490848269, -1.1823464683665712,  0.1722857012161976,
  0.7561942249654131, -0.4689119720903258]
Length: 8, dtype: float64

In [7]:
data = np.random.randint(0, 7, size=50)

In [8]:
data

array([4, 3, 5, 1, 4, 0, 2, 2, 4, 3, 0, 3, 6, 4, 6, 5, 3, 2, 5, 4, 1, 2,
       4, 5, 3, 2, 1, 5, 1, 0, 3, 4, 2, 5, 6, 6, 6, 0, 4, 0, 0, 0, 3, 4,
       1, 3, 3, 6, 5, 0])

In [10]:
s = pd.Series(data)

In [11]:
s.value_counts()

4    9
3    9
0    8
5    7
6    6
2    6
1    5
dtype: int64

In [12]:
s5 = pd.Series([1, 1, 3, 3, 3, 5, 5, 7, 7, 7])

In [13]:
s5.mode()

0    3
1    7
dtype: int64

In [18]:
df5 = pd.DataFrame({"A": np.random.randint(0, 7, size=50),
                    "B": np.random.randint(-10, 15, size=50)})

In [19]:
df5.mode()

     A   B
0  5.0   7
1  NaN  11

In [20]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

In [21]:
s

a   -0.404805
b   -0.145929
c   -1.010255
d   -0.719659
e   -0.591384
dtype: float64

In [22]:
s.reindex(['e', 'b', 'f', 'd'])

e   -0.591384
b   -0.145929
f         NaN
d   -0.719659
dtype: float64

In [23]:
df = pd.DataFrame({
     'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
     'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
     'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [24]:
df

        one       two     three
a  0.199699  0.923832       NaN
b -0.135541  0.239176 -1.672832
c  0.035466  0.732485 -1.274550
d       NaN -1.151420  0.298440

In [25]:
df.reindex(index=['c', 'f', 'b'], columns=['three', 'two', 'one'])

      three       two       one
c -1.274550  0.732485  0.035466
f       NaN       NaN       NaN
b -1.672832  0.239176 -0.135541

In [26]:
df.reindex(['c', 'f', 'b'], axis='index')

        one       two     three
c  0.035466  0.732485 -1.274550
f       NaN       NaN       NaN
b -0.135541  0.239176 -1.672832

In [27]:
df

        one       two     three
a  0.199699  0.923832       NaN
b -0.135541  0.239176 -1.672832
c  0.035466  0.732485 -1.274550
d       NaN -1.151420  0.298440

In [28]:
df.drop(['a', 'd'], axis=0)

        one       two     three
b -0.135541  0.239176 -1.672832
c  0.035466  0.732485 -1.274550

In [29]:
df.drop(['one'], axis=1)

        two     three
a  0.923832       NaN
b  0.239176 -1.672832
c  0.732485 -1.274550
d -1.151420  0.298440

In [30]:
s

a   -0.404805
b   -0.145929
c   -1.010255
d   -0.719659
e   -0.591384
dtype: float64

In [31]:
s.rename(str.upper)

A   -0.404805
B   -0.145929
C   -1.010255
D   -0.719659
E   -0.591384
dtype: float64

In [32]:
df.rename(columns={'one': 'foo', 'two': 'bar'},
              index={'a': 'apple', 'b': 'banana', 'd': 'durian'})

             foo       bar     three
apple   0.199699  0.923832       NaN
banana -0.135541  0.239176 -1.672832
c       0.035466  0.732485 -1.274550
durian       NaN -1.151420  0.298440

In [33]:
df.rename({'one': 'foo', 'two': 'bar'}, axis='columns')

        foo       bar     three
a  0.199699  0.923832       NaN
b -0.135541  0.239176 -1.672832
c  0.035466  0.732485 -1.274550
d       NaN -1.151420  0.298440

In [34]:
df.rename({'a': 'apple', 'b': 'banana', 'd': 'durian'}, axis='index')

             one       two     three
apple   0.199699  0.923832       NaN
banana -0.135541  0.239176 -1.672832
c       0.035466  0.732485 -1.274550
durian       NaN -1.151420  0.298440

In [35]:
s = pd.Series(pd.date_range('20130101 09:10:12', periods=4))

In [36]:
s

0   2013-01-01 09:10:12
1   2013-01-02 09:10:12
2   2013-01-03 09:10:12
3   2013-01-04 09:10:12
dtype: datetime64[ns]

In [37]:
s.dt.hour

0    9
1    9
2    9
3    9
dtype: int64

In [38]:
s.dt.second

0    12
1    12
2    12
3    12
dtype: int64

In [39]:
s.dt.day

0    1
1    2
2    3
3    4
dtype: int64

In [40]:
s.dt.dayofweek

0    1
1    2
2    3
3    4
dtype: int64

In [41]:
stz = s.dt.tz_localize('US/Eastern')

In [42]:
stz

0   2013-01-01 09:10:12-05:00
1   2013-01-02 09:10:12-05:00
2   2013-01-03 09:10:12-05:00
3   2013-01-04 09:10:12-05:00
dtype: datetime64[ns, US/Eastern]

In [43]:
stz.dt.tz

In [44]:
s.dt.tz_localize('UTC').dt.tz_convert('US/Eastern')

0   2013-01-01 04:10:12-05:00
1   2013-01-02 04:10:12-05:00
2   2013-01-03 04:10:12-05:00
3   2013-01-04 04:10:12-05:00
dtype: datetime64[ns, US/Eastern]

In [45]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'],
                  dtype="string")

In [46]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5    <NA>
6    caba
7     dog
8     cat
dtype: string

In [47]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [50]:
unsorted_df = df.reindex(index=['a', 'd', 'c', 'b'],
                          columns=['three', 'two', 'one'])

In [52]:
unsorted_df

      three       two       one
a       NaN -2.389283 -2.146553
d  0.501201 -0.667274       NaN
c  0.468779  0.227775  1.703044
b -0.833559 -0.703922 -0.579810

In [53]:
unsorted_df.sort_index()

      three       two       one
a       NaN -2.389283 -2.146553
b -0.833559 -0.703922 -0.579810
c  0.468779  0.227775  1.703044
d  0.501201 -0.667274       NaN

In [54]:
unsorted_df.sort_index(ascending=False)

      three       two       one
d  0.501201 -0.667274       NaN
c  0.468779  0.227775  1.703044
b -0.833559 -0.703922 -0.579810
a       NaN -2.389283 -2.146553

In [55]:
unsorted_df.sort_index(axis=1)

        one     three       two
a -2.146553       NaN -2.389283
d       NaN  0.501201 -0.667274
c  1.703044  0.468779  0.227775
b -0.579810 -0.833559 -0.703922

In [56]:
unsorted_df['three'].sort_index()

a         NaN
b   -0.833559
c    0.468779
d    0.501201
Name: three, dtype: float64

In [57]:
df1 = pd.DataFrame({'one': [2, 1, 1, 1],
                        'two': [1, 3, 2, 4],
                        'three': [5, 4, 3, 2]})

In [59]:
df1

   one  two  three
0    2    1      5
1    1    3      4
2    1    2      3
3    1    4      2

In [58]:
df1.sort_values(by='two')

   one  two  three
0    2    1      5
2    1    2      3
1    1    3      4
3    1    4      2

In [60]:
df1[['one', 'two', 'three']].sort_values(by=['one', 'two'])

   one  two  three
2    1    2      3
1    1    3      4
3    1    4      2
0    2    1      5

In [61]:
s[2] = np.nan

In [62]:
s

0       A
1       B
2    <NA>
3    Aaba
4    Baca
5    <NA>
6    CABA
7     dog
8     cat
dtype: string

In [63]:
s.sort_values()

0       A
3    Aaba
1       B
4    Baca
6    CABA
8     cat
7     dog
2    <NA>
5    <NA>
dtype: string

In [64]:
# Build MultiIndex
idx = pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('a', 2),
                                   ('b', 2), ('b', 1), ('b', 1)])

In [65]:
idx.names = ['first', 'second']

In [66]:
idx

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 2),
            ('b', 2),
            ('b', 1),
            ('b', 1)],
           names=['first', 'second'])

In [67]:
df_multi = pd.DataFrame({'A': np.arange(6, 0, -1)},
                            index=idx)

In [68]:
df_multi

              A
first second
a     1       6
      2       5
      2       4
b     2       3
      1       2
      1       1